app/controllers/comments_controller.rb

  def new
    @post = Post.find(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def create
    @comment = Comment.new(params[:comment])
    respond_to do |format|
      if verify_recaptcha
        if @comment.save
---
INSERT INTO `comments` (`created_at`, `body`, `updated_at`, `post_id`) VALUES('2009-12-25 19:38:13', 'Test of First Comment\r\n', '2009-12-25 19:38:13', 1)