app/controllers/posts_controller.rb

SELECT * FROM `posts`
SELECT * FROM `users`
---
  def index
    @posts = Post.ordered
    @users = User.all

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.post_id = 1)
---
  def show
    @post = Post.find(params[:id])
    @post_comments = @post.comments.ordered

INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`, `user_id`) VALUES('2009-12-09 02:43:16', 'Test of First Post', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aliquam fringilla euismod sodales. Maecenas ac enim ut ante porta cursus. Ut blandit consectetur lorem, quis faucibus felis volutpat et. Vivamus vehicula nulla at lorem venenatis non malesuada nisi blandit. Integer vitae ligula eget dui iaculis viverra. Vivamus eget ligula ligula, id faucibus massa. Suspendisse sed enim non orci pulvinar ullamcorper. Donec vel mi nisi, vel elementum neque. Morbi feugiat pharetra sem at consectetur. Aliquam at nisi vitae ante faucibus aliquam sed eu tortor.', '2009-12-09 02:43:16', 1)
---
  def create
    @post = Post.new(params[:post])
    @post.user = current_user
    respond_to do |format|
      if @post.save